In [1]:
import pandas as pd

In [2]:
import numpy as py

In [3]:
import matplotlib.pyplot as plt

In [8]:
df1 = pd.DataFrame()
df2 = pd.DataFrame()
df3 = pd.DataFrame()
df1['age']  = [14, 12, 11, 10, 8, 8, 6]
df2['age']  = [14, 12, 11, 10, 8, 8, 7]
df3['age']  = [14, 12, 11, 10, 8, 7, 1]

In [10]:
df1.describe()

             age
count   7.000000
mean    9.857143
std     2.734262
min     6.000000
25%     8.000000
50%    10.000000
75%    11.500000
max    14.000000

In [11]:
df2.describe()

             age
count   7.000000
mean   10.000000
std     2.516611
min     7.000000
25%     8.000000
50%    10.000000
75%    11.500000
max    14.000000

In [12]:
df3.describe()

             age
count   7.000000
mean    9.000000
std     4.242641
min     1.000000
25%     7.500000
50%    10.000000
75%    11.500000
max    14.000000